{
  "Navigation": {
    "home": "Início",
    "about": "Sobre",
    "skills": "Skills",
    "projects": "Projetos",
    "contact": "Contato",
    "lang": {
      "select": "Selecione",
      "selected": "PT-BR",
      "label": "Idiomas"
    }
  },
  "Home": {
    "greetings": "Olá, eu me chamo",
    "my_name": "Otávio",
    "job_position": "Desenvolvedor Fullstack",
    "presentation": "Atualmente uilizo Next.js e Golang como linguagens principais juntamente com Docker e PostgreSQL, criando sistemas web escaláveis e de alta performance. Possuo grande interesse em Arquitetura de Software e prossigo estudando para obter conhecimentos avançados sobre MVC, Layers, Monolitos e Microserviços, assim como a conversão de sistemas Monolíticos para Microserviços",
    "skills": {
      "title": "Skills",
      "first_desc": [
        {
          "text": "Atualmente este projeto faz uso dessas tecnologias, que representam as principais ferramentas do meu dia a dia. São tecnologias que aplico tanto no ambiente de trabalho quanto em projetos pessoais, sempre buscando boas práticas, escalabilidade e qualidade no desenvolvimento."
        },
        {
          "text": "Além disso, essas tecnologias refletem meu foco em entregar soluções modernas, performáticas e alinhadas às necessidades reais de cada projeto."
        }
      ],
      "second_desc": {
        "text": "Além das tecnologias acima, também possuo conhecimento com outras tecnologias. Elas estão separadas por tipo e você pode conferir no card."
      }
    }
  },
  "Experience": {
    "title": "Experiência",
    "experiences": [
      {
        "company": "ASTRA S/A",
        "roles": [
          {
            "job_title": "Desenvolvedor Fullstack",
            "period": "Jun. 2025 - Presente",
            "desc": "Desenvolvimento de aplicações web com Go, React, PostgreSQL e Docker. Criação de APIs REST e integração de sistemas. Implementação de soluções escaláveis e de alta performance. Uso de boas práticas em arquitetura de software e DevOps."
          },
          {
            "job_title": "Estagiário em Desenvolvimento de Sistemas",
            "period": "Jan. 2025 - Mai. 2025",
            "desc": "Desenvolvimento de interfaces web com HTML, CSS e JavaScript. Criação de fluxos e formulários no TOTVS Fluig. Integração de APIs REST e automação de processos internos."
          }
        ]
      }
    ]
  }
}